LC3WithExtensionFilling/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1616;
        startFace       180391;
    }
    defaultFaces
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9640;
        startFace       182007;
    }
    gate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          847;
        startFace       191647;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          425;
        startFace       192494;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       192919;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          504;
        startFace       194919;
    }
)

// ************************************************************************* //
